[
  {
    "model": "rjh_rpg.gamescenes",
    "pk": 6,
    "fields": {
      "name": "🧸 Monsterjäger-Dojo",
      "req_players": 3,
      "welcome_text": "Hier wird niemand sterben. Zumindest ist hier bis jetzt noch niemand gestorben!<br><br>",
      "boss_welcome_text": "Schlag mich!",
      "enemy_name": "🎯 Trainigsziel 🎯",
      "enemy_hp": 1000,
      "enemy_ap": 1,
      "enemy_image": "training_dummy.mp4",
      "enemy_dead_image": "dojo_background.jpeg",
      "intro_image": "dojo_intro.jpg",
      "intro_text":"„Es tut nicht weh. Keine Angst.“ Genau das hat euer Trainer immer gesagt als er euch durch den Trainingsparcours gescheucht hat. Ihr habt es gehasst, denn natürlich tat es weh, als er mit euch trainiert hat. Immer wenn ihr eure Deckung vernachlässigt habt, hat er es euch schmerzhaft spüren lassen. Und selbstverständlich seid ihr ihm dankbar für diese Lektionen, denn sie haben euch bis heute am Leben gehalten. <br>Heute wird es allerdings anders sein, denn ihr seid nur hier, um ein paar neue Techniken an der Trainingspuppe zu testen!",
      "win_text": "Holla! Das war nicht überraschend. Aber dass die Trainingspuppe nach eurem letzten sauberen Hieb in ihre Einzelteile zerfällt, das hattet ihr nicht erwartet.",
      "gameover_text": "Oh, da muss die Trainingspuppe locker gewesen sein. Durch einen eurer heftigen Schläge muss sie sich gedreht und euch unglücklich am Kopf getroffen haben."
    }
  },
  {
    "model": "rjh_rpg.gamescenes",
    "pk": 5,
    "fields": {
      "name": "🌲 Am Rande des Dunkelwaldes",
      "req_players": 1,
      "welcome_text": "Du und der Warg beäugt euch auf der Lichtung, dann greift er dich mit gefletschten Zähnen an!<br><br>",
      "boss_welcome_text": "Warg fletscht hörbar die Zähne!",
      "enemy_name": "🐺 Schrecklicher Warg 🐺",
      "enemy_hp": 140,
      "enemy_ap": 45,
      "enemy_image": "warg_3840x2160.mp4",
      "enemy_dead_image": "warg_background_3840x2160.jpg",
      "intro_image": "woods_edge_3840x2160.jpg",
      "intro_text":"An diesem einst vielleicht nicht so trostlosem Ort berichtet der Dorfvorsteher, dass die umliegenden Bauern sich schon seit längerem beklagen, dass ihr Vieh den Angriffen von wilden Tieren ausgesetzt ist. Aber in jüngster Zeit scheinen die Angriffe häufiger zu werden und ganze Herden werden dahingemetzelt. Jüngst ist sogar eine Hochschwangere den Angriffen zum Opfer gefallen. Außerdem erzählen die Einheimischen von riesigen Wölfen mit glühenden Augen und keiner traut sich mehr vor die Tür. Die Miliz hat fast noch mehr Angst als die Bauern und scheint hoffnungslos überfordert, diese Feiglinge. Deshalb sind alle sehr erfreut, dass ihrdu dich der Aufgabe annehmen möchtest. Der Dank der Menschen scheint dir gewiss! <br><br>Als du den letzten Tatort in Augenschein nimmst, wird dir schnell klar, dass die Bauern nicht ganz Recht haben, denn du findest, zwischen all dem Blut, riesige Abdrücke von Wolfstatzen, die in den Wald führen. Aber nur von einem Wolf. Dafür ist dieser mindestens so groß, dass man darauf reiten könnte. Du tippst auf einen Warg, der hier seine Jagdgründe hat. Du richtest dich auf und folgst den Spuren in den Wald hinein. Tiefer im Wald, auf einer Lichtung, schaust du dich um und nehmtnimmst eine Bewegung wahr. Da siehst du ihn, groß wie ein Ochse, zumindest wirst du es so in deinen Geschichten erzählen und er taxiert dich mit seinen Blicken, dann geht er unmittelbar zum Angriff über.",
      "win_text": "Nach einem harten Kampf ist auf dieser einst so idyllischen Lichtung fast nur noch Blut, das der Opfer, deines und natürlich das des von dir zerhackten Wargs. Zusammen mit den bunten Blumen ergibt es fast ein eigenes Kunstwerk. Du fühlst dich beschwingt durch deinen Sieg und dies lindert den Schmerz deiner Wunden. Dennoch fügst du deiner Sammlung ein paar hübsche Narben hinzu, die du bei den Heldengeschichten am Lagerfeuer als Beweis für deine Taten vorzeigen kannst.",
      "gameover_text": "Der Warg war ein härterer Gegner als erwartet und du musst dich halb tot zurückziehen, um es an einem anderen Tag erneut mit ihm aufzunehmen. Diesmal bist du es und nicht der Warg, der sich die Wunden leckt. Und es gibt ein paar hübsche Narben für deine Sammlung."
    }
  },
  {
    "model": "rjh_rpg.gamescenes",
    "pk": 1,
    "fields": {
      "name": "🏰 Das Alte Anwesen",
      "req_players": 1,
      "welcome_text": "In der großen Halle stehst du dem Vampierfürst gegenüber. Er breitet seine ledrigen Flügel aus und greift dich mit Mordlust in den roten Augen an!<br><br>",
      "boss_welcome_text": "Dein Blut riecht köstlich, lass mich davon kosten!",
      "enemy_name": "🦇 Blutrünstiger Vampirfürst 🦇",
      "enemy_hp": 300,
      "enemy_ap": 50,
      "enemy_image": "vampire_3840x2160.mp4",
      "enemy_dead_image": "vampire_background_3840x2160.jpg",
      "intro_image": "manor_3840x2160.jpg",
      "intro_text": "Du bist in letzter Zeit viel herumgekommen und gönnst dir nun eine wohlverdiente Pause in einem Gasthaus an der Wegekreuzung. Hier werden die Pferde der Kutschen gewechselt und Reisende, die die Nacht nicht auf der Straße verbringen wollen, können hier ein gutes Essen und ein warmes Bett für die Nacht bekommen. Bevor es für dich jedoch so weit ist, gönnst du dir noch das ein oder andere Bier im Schankraum. Du bist nicht zum ersten Mal hier und der Wirt und vielleicht der ein oder andere Kutscher, die hier rasten, wissen was du tust. Man ist dir dankbar dafür, dass du die Straßen und die Gegend frei von Monstern hältst. Deshalb geht nicht jedes Bier auf deine eigene Rechnung. Früher als die meisten gehst du zu Bett, denn deine Glieder sind nicht nur vom Bier, sondern auch von den Anstrengungen der letzten Zeit schwer wie Blei. Noch während du einschläfst, fragst du dich wie die Zecher morgen rechtzeitig die Pferde angespannt bekommen geschweige denn eine Kutsche auf der Straße halten wollen. Aber das ist eins dieser Probleme, dessen du dich nicht annehmen musst. Jäh in der Nacht wirst du von einem Schreckensschrei geweckt und noch während du dich müde aufkämpfst, wird wild an deine Tür gepocht. Und da sind sie, deine Probleme.<br><br>Ein paar Tage danach stehst Du, auf der Suche nach dem kleinen Mädchen, in einer großen prachtvollen Halle, die sicher schon bessere Tage gesehen hat. Das Licht des Tages ist schon längst erloschen und der große Raum wird von einem großen Kronleuchter mit unzähligen Kerzen erleuchtet. Es bleiben aber noch genug dunkle Schatten und unbeleuchtete Ecken in denen sich ständig etwas zu bewegen scheint. Die einst prachtvollen Gemälde an den Wänden, die Personen und Szenen aus vergangenen Zeiten zeigen, sind längst verblasst und der dekorative Stuck an Decken und Wänden bröckelt und fehlt teilweise komplett. Dennoch lasen die Reste die einstige Pracht des Raumes erahnen. Am rechten Rand des Raums steht eine Tafel mit weißen Decken, feinstem Porzellan und goldenem Besteck. Und direkt vor der Treppe zum nächsten Stockwerk steht sie, eine fahle Gestalt, ihre Kleidung ist dunkel, lang und weit. Eine Kapuze verbirgt ihr Gesicht und ein hoher Kragen rahmt den Kopf ein. Und als ob die Gestalt deine Gedanken gelesen hätte, sagt sie zu dir: „Das junge Mädchen aus der Taverne, das du seit Tagen suchst, wirst du hier nicht finden, nicht mehr…“ Dann ertönt ein diabolisches Lachen, die Augen der Kreatur beginnen rot zu leuchten, ledrige Flügel entfalten sich auf ihrem Rücken und die Finger werden zu langen scharfen Klauen. Mit einem schrillen Schrei stürzt sich die Kreatur auf dich!",
      "win_text": "Der Tod des jungen Mädchens und der Zorn darüber nicht mal eine ungestörte Nacht verbringen zu können, scheint dich beflügelt zu haben. Denn trotz der Stärkung, die der Vampir noch kurz vor eurem Kampf zu sich genommen hatte, war es ihm nicht möglich dich ernsthaft in Gefahr zu bringen. Nachdem du ihn mit einem deiner Schwerter auf die gedeckte Tafel genagelt hattest, hast du ihm mit einem einzigen, sauberen Hieb den Kopf von den Schultern getrennt. Nun stehst du vor dem durch dich in Flammen getauchten Anwesen und achtest darauf, dass nichts dem Flammenmeer entkommt.",
      "gameover_text": "Das Blut des jungen Mädchens scheint den Vampir über die Maßen gestärkt zu haben, so dass es dir nicht möglich war ihn zu überwinden. Er war einfach zu schnell und er schien jeden deiner Hiebe vorauszuahnen und viele trafen ins Leere. Und wenn du einmal einen guten Treffer gelandet hattet, schlossen sich seine Wunden sofort wieder. Zum Glück war der Morgen nicht mehr weit und du konntest dich ins Freie unter die aufgehende Morgensonne retten. Doch du bist dir sicher, dass den Vampir noch in der nächsten Nacht sein Glück verlassen würde."
    }
  },
  {
    "model": "rjh_rpg.gamescenes",
    "pk": 2,
    "fields": {
      "name": "🌋 Der Ascheberg",
      "req_players": 1,
      "welcome_text": "Am Rande des Lavasees, mitten in den Katakomben des Vulkans, stehst du Ascheschwinge, dem Mörder deiner großen Liebe gegenüber. Mit blanker Wut und Tränen in Augen greifst du ihn an!<br><br>",
      "boss_welcome_text": "Kleiner Menschling, du stikst nach Angst! Ich werde dich zerquetschen wie ein Insekt!",
      "enemy_name": "🐲 Roter Drache Ascheschwinge 🐲",
      "enemy_hp": 500,
      "enemy_ap": 60,
      "enemy_image": "dragon_3840x2160.mp4",
      "enemy_dead_image": "dragon_background_3840x2160.jpg",
      "intro_image": "volcano_3840x2160.jpg",
      "intro_text": "Ich liebe dich, hatte sie zu dir gesagt. Langes, kastanienbraunes Haar wallte über ihre nackten Schultern als sie in deiner Kammer im Wirtshaus über Euch gebeugt jede deiner unzähligen Narben geküsst hatte. Mit einem breiten Lächeln erinnerst du dich daran. Wirklich jede einzelne, sogar diese kleine … und dann der Duft ihres Haares, wie ein Blumenmeer, gemischt mit Minze und einem Hauch von Zimt und ihre zarten liebevollen Berührungen. Der Blick voller Liebe, Wärme und Freude den sie dir zuwarf als sie sich verabschiedete und sagte sie müsse jetzt gehen, ihr Vater würde ohnehin schon Verdacht schöpfen. Ihr gehauchtes, ich liebe dich, als sie auf die Straße trat und der kesse Blick über die Schulter, den sie dir auf der Straße zuwarf, als sie im Dunkeln verschwand …<br><br>Schlagartig verfinstert sich deine Stimmung und du versucht die Bilder zu vertreiben, die sich an die Oberfläche deines Bewusstseins drängen. Das Rot und Orange des Flammenmeers, das sich die Straße herunter wälzt und die Hitze, die dir die Brauen versengt und dich zurück ins Haus treibt. Überall Schreie und als du wieder auf die Straße tritst, hast du es gesehen, das Grauen, dass immer wieder auf die Stadt vom Himmel herabstößt und mit seinem Feueratem Tod und Zerstörung bringt. Nach dem Angriff des Drachens blieb nur der Geruch von verkohltem Holz und verbranntem Fleisch, keine Blumen, keine Minze, kein Zimt … Du hast sie nie wieder gesehen. <br><br>Nun stehst du hier, oben am Vulkankegel, und blickst hinab auf den Lavasee an dessen Ufer sich eine alter Zwergenschacht in den Berg öffnet. Der beißende Gestank nach Schwefel und die Hitze erinnern dich wieder an das Grauen von damals. Vorbei an Feldern voller gelbem Schwefel, der kleine, spitze Kristalle bildet, steigst du hinab zum Eingang, wo du hofft Erlösung im Tod zu finden, in seinem oder deinem, so oder so wird es hier und heute enden. Laut rufst du, voller Hass und Schmerz: „Ascheschwinge ich bin hier, um dich zu töten!“",
      "win_text": "Nur noch halb am Leben, aber das erste Mal frei von Schwermut atmest du die frische Luft am Kraterrand, der Blick zurück zeigt den monströsen Kadaver von Acheschwinge, zum Teil in der Lava liegend mit abgetrenntem Kopf und zerfetzen Schwingen. Es war ein harter Kampf, der dich weit über deine Grenzen hinaus gefordert hat. Und die Brandnarben, die dich zieren, zeugen für alle sichtbar von dem Kampf. Das stört dich nicht weiter, denn lieben wirst du ohnehin nicht mehr. Du richtet den Blick nach vorn, obwohl du dir einen kurzen Blick zurück zu Blumen, Minze und einem Hauch von Zimt nicht verkneifen kannst.",
      "gameover_text": "Ascheschwinge hat dich geschlagen. Du bist gerade so mit deinem Leben davongekommen, tiefe Wunden und etliche schlimme Verbrennungen zieren dein Äußeres. Nicht der Wille zum Leben, sondern der pure Hass halten dich am Leben und di wirst schon bald zurückkehren, um dem alten Wurm die Schmerzen zu bereiten, die er verdient hat, denn Rache duftet so süß nach Blumen, Minze und einem Hauch von Zimt."

    }
  },
  {
    "model": "rjh_rpg.gamescenes",
    "pk": 3,
    "fields": {
      "name": "⛏️ Die verlassene Mine",
      "req_players": 3,
      "welcome_text": "In der Kammer, inmitten all des Unrats, steht ihr und seht wie der riesige Wurm stinkenden Geifer verspritzt und sich auf euch stürzt!<br><br>",
      "boss_welcome_text": "Kreischt unnatürlich schrill!",
      "enemy_name": "🐍 Widerliches Wurmwesen 🐍",
      "enemy_hp": 500,
      "enemy_ap": 50,
      "enemy_image": "worm_3840x2160.mp4",
      "enemy_dead_image": "worm_background_3840x2160.jpg",
      "intro_image": "mine_3840x2160.jpg",
      "intro_text":"Da ist er, der alte Minenschacht, genauso wie der alte Säufer in der Taverne gesagt hatte. Nicht leicht zu finden, nur mit einer gelallten Wegbeschreibung eines zahnlosen Greises. Einen schier endlosen, zugewucherten Pfad entlang, auf halber Höhe zum Gipfel, liegt er. Eine Wegbiegung, und die dichte Vegetation verbirgt ihn vor den Blicken von der nahegelegenen, aber nur noch wenig genutzten Handelsstraße. Laut dem Alten gaben die Zwerge, die hier einst nach kostbaren Edelmetallen schürften, den Schacht schon vor langer Zeit aus unbekannten Gründen auf. Und niemand der seitdem sein Glück versuchte die Geheimnisse der Mine zu ergründen kam je zurück, um davon zu berichten. Nun seid ihr hier und steht vor dem Eingang zum alten Schacht. Erstaunlich gut hat die zwergische Handwerkskunst den Eingang zur Miene gestützt, die Balken scheinen noch zu tragen und sogar die Überreste eines Lorengleises sind noch zu sehen.<br><br> Immer tiefer geht ihr die Stollen hinab ins Dunkel, nur das spärliche Licht eurer Laternen weist euch den Weg. Je weiter ihr in den Berg gelangt umso drückender wirkt das Gestein über euch und die Luft wird spürbar schlechter. Plötzlich weitet sich der Gang zu einer Kammer und es stinkt furchtbar nach Verwesung und Ausscheidungen. Im Licht eurer Laternen seht ihr, dass ihr mitten in einem Haufen Unrat und halb verdauten Resten von unglücklichen Tieren, und schlimmer von Menschen steht, die sich hierhin verirrt haben. Euch fällt auf, dass von der Kammer Tunnel abgehen, die offensichtlich nicht von Mienenarbeitern geschaffen wurden und in einem regt sich etwas. Ihr seht eine groteske Mischung aus gigantischer Made und Regenwurm, die von ihrer aschgrauen Haut eine übelriechende, schleimige Flüssigkeit abgibt. Aber der große mit sägezahnartigen Zähnen besetze Schlund des Untiers fällt euch noch mehr ins Auge. Und während ihr noch darüber nachdenkt, ob diese Kreatur für das Aufgeben der Mine gesorgt hat oder sie erst später eingezogen ist, greift sie euch mit wildem Fauchen an.",
      "win_text": "Euch ist es gelungen das Biest zu töten. Seine Haut war dick und die Reste des Schleims an euren Waffen und Rüstungen stinkt, dass es euch die Tränen in die Augen treibt. Was das Biest war, wolltet ihr in seinen stinkenden Überresten nicht herausfinden und ob es noch mehr von ihnen gibt, dafür wolltet ihr nicht lang genug bleiben. Aber die Münzen, die ihr gefunden habt, werden für all das entschädigen. Und die Geschichten, die in den Tavernen erzählt werden, werden so manche Narbe, im ehrlichen Kampf erworben, noch gefährlicher wirken lassen.",
      "gameover_text": "Die Kreatur hat sich als ebenbürtiger Gegner erwiesen, an der sich sogar ein sturer Zwerg die Zähne ausgebissen hätte. Es war euch leider nicht möglich ihre dicke, ledrige und mit Schleim überzogene Haut zu durchdringen und mit ihrem übelriechenden Schleim und Ihren Sägezähnen hat sie euch übel mitgespielt. Die Augen und die Lunge brennen von dem Gestank und die Wunden bluten stark, aber ihr glaubt etwas in der Kammer glitzern gesehen zu haben und ihr werdet zurückkehren, um herauszufinden was."
    }
  },
  {
    "model": "rjh_rpg.gamescenes",
    "pk": 4,
    "fields": {
      "name": "⚰️ Der Friedhof in den Sümpfen",
      "req_players": 3,
      "welcome_text": "Als ihr in die Krypta des Friedhofs hinabsteigt, bebt der Boden und ein riesiger Koloss aus Knochen greift euch mordlüstern an!<br><br>",
      "boss_welcome_text": "Tiefer, grollender Schrei!",
      "enemy_name": "💀 Untoter Koloss 💀",
      "enemy_hp": 600,
      "enemy_ap": 60,
      "enemy_image": "lasercat.mp4",
      "enemy_dead_image": "worm_background_3840x2160.jpg",
      "intro_image": "mine_3840x2160.jpg",
      "intro_text":"Ein Friedhof ist normalerweise ein stiller und friedvoller Ort. Des Nachts vielleicht etwas unheimlich und immer für eine Schauergeschichte gut, aber diesmal scheint es anders. Hier ist schon lange keine Beerdigung mehr gewesen, denn im Umkreis lebt schon ewig keine Seele mehr. Das Land ist verdorrt, die Bäume tot und nur die Raben krächzten ihr schauriges Lied. Ihr seid hier, um zu ergründen warum diese Gegend vor so vielen Jahren verlassen wurde und ihr seid sicher, dass es irgendwie mit den Geschichten zusammenhängt, die sich über diesen Ort erzählt werden. Die einen berichten von wiederkehrenden Missernten und dem Austrocknen der Flüsse und Bäche, wieder andere von nächtlichem Spuk in der Gegend und wieder andere gar von einem uralten Schlachtfeld aus längst vergangenen Tagen, auf dem dieser Landstrich ruht, und dass die Toten ihren Platz wieder einfordern.<br>br>Je näher ihr kommt umso mehr beschleicht euch das Gefühl, dass an allem was ihr gehört habt ein Körnchen Wahrheit ist und noch viel schlimmer. Denn an diesem Ort kann man das Böse nicht nur spüren sondern fast anfassen. Als ihr durch das große schmiedeeiserne Tor am Eingang des Friedhofs tretet, seht ihr die vielen offenen Gräber, wie von innen heraus aufgebrochen, und dann hört ihr den markerschütternden Schrei und spürt das Beben des Bodens. Der Schrei schien aus der Krypta auf dem Hügel vor Euch zu kommen ...",
      "win_text": "Der Knochengolem ist besiegt und das war selbst mit vereinten Kräften kein leichtes Unterfangen. Der schiere Hass der Bestie auf alles Lebende hätte euch fast bezwungen, aber eure Gemeinschaft und euer individuelles Können hat euch hier wie schon so oft zuvor gerettet. Eure Wunden, von unheiligen Klauen gerissen, heilen langsam und es fällt euch schwer das Grauen dieses Ortes zu vergessen. Ihr glaubt das nicht einmal die Wärme des Lagerfeuers, an dem Ihr diese Geschichte erzählen werdet, ganz die Kälte vertreiben kann, die hier versucht hat, von euch Besitz zu ergreifen.",
      "gameover_text": "Der riesige Knochengolem ist ein harter Brocken und selbst mit vereinten Kräften war es euch nicht möglich ihn in die Knie zu zwingen. Es war euch gerade so möglich eure Leben und noch viel wichtiger eure Seelen, zu retten. Eure Wunden sind nicht nur körperlich, sondern die Angst und der Hass an diesem Ort haben sich tief eingebrannt. Der Gedanke an diesen Ort zurück kehren zu müssen, erfüllt euch mit einer tiefen, fast unerträglichen Kälte und Schwere."
    }
  },

  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 1,
    "fields": {
      "name": "xp_to_spend_factor",
      "type": "float",
      "value": "0.25",
      "hint": "used in views.py in 'hpap' function to speed up the process of spending xp. instead of spend one xp at a time, this takes a percentage of the total value of available xp and spends them. \r\nthis is the factor to calculate it."
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 2,
    "fields": {
      "name": "char_class_m_base_hp",
      "type": "int",
      "value": "160",
      "hint": "default hp for a new char, class mage"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 3,
    "fields": {
      "name": "char_class_m_base_ap",
      "type": "int",
      "value": "50",
      "hint": "default ap for a new char, class mage"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 4,
    "fields": {
      "name": "char_class_p_base_ap",
      "type": "int",
      "value": "30",
      "hint": "default ap for a new char, class priest"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 5,
    "fields": {
      "name": "char_class_p_base_hp",
      "type": "int",
      "value": "180",
      "hint": "default hp for a new char, class priest"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 6,
    "fields": {
      "name": "char_class_w_base_hp",
      "type": "int",
      "value": "200",
      "hint": "default hp for a new char, class warrior"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 7,
    "fields": {
      "name": "char_class_w_base_ap",
      "type": "int",
      "value": "40",
      "hint": "default ap for a new char, class warrior"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 8,
    "fields": {
      "name": "lobby_countdown_duration",
      "type": "int",
      "value": "6",
      "hint": "duration in seconds for the countdown in the lobby before start."
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 9,
    "fields": {
      "name": "factor_bonus_xp_on_win",
      "type": "float",
      "value": "2.0",
      "hint": "if a game is won, this factor is used to calculate the bonus xp to all players (xp of all players of the game * this factor)"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 10,
    "fields": {
      "name": "dmg_min",
      "type": "float",
      "value": "0.7",
      "hint": "minimun damage that is given based on the ap of char or enemy"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 11,
    "fields": {
      "name": "dmg_max",
      "type": "float",
      "value": "1.0",
      "hint": "maximum damage that is given based on the ap of char or enemy"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 12,
    "fields": {
      "name": "xp_to_give_factor",
      "type": "float",
      "value": "0.2",
      "hint": "factor that is being used when giving a char xp. mostly the number that comes in is damage given or the ap of a char when unsing its special ability."
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 13,
    "fields": {
      "name": "ability_m_duration_rounds",
      "type": "int",
      "value": "2",
      "hint": "mage ability will be applyed to this number of next rounds"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 14,
    "fields": {
      "name": "ability_p_duration_rounds",
      "type": "int",
      "value": "4",
      "hint": "priest ability will be applyed to this number of next rounds"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 15,
    "fields": {
      "name": "ability_w_duration_rounds",
      "type": "int",
      "value": "3",
      "hint": "warrior ability will be applyed to this number of next rounds"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 16,
    "fields": {
      "name": "ability_w_effect_strength",
      "type": "float",
      "value": "0.20",
      "hint": "strength of the warrior ability in percent (written in float, 0.1 = 10%, 0.5 = 50%)"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 17,
    "fields": {
      "name": "ability_p_effect_strength",
      "type": "float",
      "value": "0.08",
      "hint": "strength of the priest ability in percent (written in float, 0.1 = 10%, 0.5 = 50%)"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 18,
    "fields": {
      "name": "ability_m_effect_strength",
      "type": "float",
      "value": "0.6",
      "hint": "strength of the mage ability in percent (written in float, 0.1 = 10%, 0.5 = 50%)"
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 19,
    "fields": {
      "name": "xp_hp_conversion_factor",
      "type": "float",
      "value": "1.0",
      "hint": "conversion rate when spending hp (written in float, 0.1 = 10%, 0.5 = 50%). when 1: 1xp=1hp, when 0.5: 1xp=0.5hp."
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 20,
    "fields": {
      "name": "xp_ap_conversion_factor",
      "type": "float",
      "value": "0.25",
      "hint": "conversion rate when spending ap (written in float, 0.1 = 10%, 0.5 = 50%). when 1: 1xp=1ap, when 0.5: 1xp=0.5ap."
    }
  },
  {
    "model": "rjh_rpg.myrpgconfig",
    "pk": 21,
    "fields": {
      "name": "chat_timeout",
      "type": "int",
      "value": "5",
      "hint": "time in seconds before a user/char gets deletet from the chat userlist in the worldmap and the lobby."
    }
  }    
]
